app/controllers/registration_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2024-09-10 07:06:03.882427"], ["updated_at", "2024-09-10 07:06:03.882427"]]
---
  def create
    @user = User.new(user_params)

    if @user.save